
%Индивидуальное задание № 5. База данных
%
%Составить базу данных на произвольную выбранную тему. Таблицы хранятся в виде фактов в отдельном файле. 3 таблицы, две независимые, одна зависимая, связь 1 ко многим. Должна быть реализована возможность просмотра каждой таблицы, добавления, изменения и удаления выбранных записей. При отображении зависимой таблицы отображать не ключи, а записи в соответствующих полях. Должно быть реализовано три запроса, вывод на экран и в файл. 2 запроса простых по одной таблице и один с применением всех трех таблиц.